{
  "ir_version": "1.0.0",
  "generated_at": "2026-01-20T22:46:15.733259Z",
  "alpha": 0.5,
  "hybrid_share": {
    "Search": 0.42,
    "Email": 0.25,
    "Direct": 0.18,
    "Social": 0.1,
    "Display": 0.05
  },
  "confidence_intervals": {
    "Search": {
      "p05": 0.35,
      "p95": 0.49
    },
    "Email": {
      "p05": 0.2,
      "p95": 0.3
    },
    "Direct": {
      "p05": 0.13,
      "p95": 0.23
    },
    "Social": {
      "p05": 0.07,
      "p95": 0.13
    },
    "Display": {
      "p05": 0.02,
      "p95": 0.08
    }
  },
  "rank_stability": {
    "Search": {
      "top1": 0.85,
      "top2": 0.98
    },
    "Email": {
      "top1": 0.12,
      "top2": 0.89
    },
    "Direct": {
      "top1": 0.03,
      "top2": 0.13
    }
  }
}