{
  "ir_version": "1.0.0",
  "generated_at": "2024-01-20T14:53:00Z",
  "alpha": 0.5,
  "hybrid_share": {
    "Search": 0.42,
    "Email": 0.25,
    "Direct": 0.18,
    "Social": 0.10,
    "Display": 0.05
  },
  "hybrid_value": {
    "Search": 63.00,
    "Email": 37.50,
    "Direct": 27.00,
    "Social": 15.00,
    "Display": 7.50
  },
  "confidence_intervals": {
    "Search": { "p05": 0.35, "p25": 0.39, "p50": 0.42, "p75": 0.45, "p95": 0.49 },
    "Email": { "p05": 0.20, "p25": 0.23, "p50": 0.25, "p75": 0.28, "p95": 0.30 },
    "Direct": { "p05": 0.13, "p25": 0.16, "p50": 0.18, "p75": 0.21, "p95": 0.23 },
    "Social": { "p05": 0.07, "p25": 0.09, "p50": 0.10, "p75": 0.12, "p95": 0.13 },
    "Display": { "p05": 0.02, "p25": 0.04, "p50": 0.05, "p75": 0.06, "p95": 0.08 }
  },
  "rank_stability": {
    "Search": { "top1": 0.85, "top2": 0.98, "top3": 0.99 },
    "Email": { "top1": 0.12, "top2": 0.89, "top3": 0.99 },
    "Direct": { "top1": 0.03, "top2": 0.13, "top3": 0.94 },
    "Social": { "top1": 0.00, "top2": 0.00, "top3": 0.08 },
    "Display": { "top1": 0.00, "top2": 0.00, "top3": 0.00 }
  },
  "invariant_checks": {
    "row_stochastic": true,
    "shares_sum_to_one": true,
    "values_sum_to_total": true,
    "quantile_ordering": true
  },
  "metadata": {
    "total_events": 50,
    "unique_users": 8,
    "conversions": 8,
    "total_conversion_value": 1059.93,
    "data_sources": ["csv"]
  }
}